testCases/YabukiNakabeppu_ML_powerlaw/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../constant/runParams"

actions
(
    
    // solid
    {
        name    solidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 -$solidLy -$Lz) ($Lx 0 $Lz);
    }
    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     solidCellSet;
    }


    // fluid
    {
        name    fluidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 0 -$Lz) ($Lx $fluidLy $Lz);
    }
    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     fluidCellSet;
    }

    
);


// ************************************************************************* //
